[
  {
    "id": "kie_scarab",
    "source": "KIE",
    "license_level": 2,
    "name": "SCARAB",
    "mechtype": [
      "Defender"
    ],
    "description": "<div>The first design made by the Rubblefolk following their contact with the wider galaxy, the SCARAB is a defender first and foremost. Primarily meant to protect mining teams from debris and local wildlife, the Scarab quickly replaced its predecessor, the “Rubbleshield”.</div><div>Widespread through the entirety of the planet, the simple base design of the Scarab provided a flexible basis to create civilian-grade working rigs: building, transport, caregivers and many more. Only once they are given enough training and reaching a certain age, are the Scarabs upgraded into the protector roles, being granted the additional battery capacitors and light projectors necessary for the deployment and control of the energy barriers typical of the role. Due to this personal growth required before the upgrade, no two scarabs are the same, despite their massive numbers, their shields are their fingerprints; each one unique in pattern, energy readings and shape. It is not uncommon for Scarabs protector cadres to bond with each other based on the similarities of their shields, usually evolving into squad bonds that can last decades as the shields sync with each other, increasing efficiency and defensive affinity.</div>",
    "mounts": [
      "Flex"
    ],
    "stats": {
      "size": 2,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": "8",
      "evasion": "9",
      "edef": "8",
      "heatcap": "5",
      "repcap": "5",
      "sensor_range": 8,
      "tech_attack": 0,
      "save": "10",
      "speed": 4,
      "sp": "7"
    },
    "traits": [
      {
        "name": "Guardian",
        "use": "",
        "description": "<div>Adjacent allied characters can use the Scarab for hard cover.</div>"
      },
      {
        "name": "Wavelength Modulation",
        "use": "",
        "description": "<div>Gain the \"Shield Transfer\" reaction.</div>",
        "actions": [
          {
            "name": "Shield Transfer",
            "activation": "Reaction",
            "detail": "<div>An Allied Character within HiveMind range would take damage from an attack.</div>",
            "pilot": false,
            "synergy_locations": [],
            "tech_attack": false,
            "frequency": "1/round",
            "init": "",
            "trigger": "<div>The Scarab may transfer any Overshield of its own to that allied character. This reaction resolves before the triggering damage. </div>"
          }
        ]
      },
      {
        "name": "Defensive Elytra",
        "use": "",
        "description": "<div>Adjacent allied characters can use the Scarab's SHIELD systems as if they had the EUSOCIAL tag.</div>"
      }
    ],
    "core_system": {
      "name": "“Bulwark” PsuedoCarapace",
      "active_name": "Hive Defender: Overcharged",
      "active_effect": "<p>For the rest of the scene, when an ally within HiveMind range starts their turn without Overshield, they gain Overshield equal to 1 + your GRIT.</p>",
      "activation": "Full",
      "description": "<p><em>The Bulwark PsuedoCarapace utilizes a series of nanite colonies and onboard fabricators to deploy a fluid covering of ablative material during high intensity combat.</em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "Hive Defender",
      "passive_effect": "<p>After an Action or Reaction granted by one of the Scarab's SHIELD systems resolves, the Scarab gains 2 Overshield. If an allied character activates a shield system through the “Eusocial” tag, they gain the Overshield instead. </p><p>Overshield generated by this Core System increases, and does not replace, any existing Overshield. Characters besides the Scarab cannot have more Overshield than half their Maximum HP.</p><p>If the Overshield had effects, it can inherit those effects, but only the effects of one system at a time (the Scarab chooses which are kept or replaced).</p>",
      "passive_actions": [],
      "passive_bonuses": [],
      "passive_synergies": [
        {
          "locations": [
            "system"
          ],
          "detail": "<p>After one of the Scarab's SHIELD systems is used, the Scarab gains 2 Overshield. If an ally activates a shield system through the “Eusocial” tag, they gain this Overshield instead.</p><p>Overshield generated by the Scarab increases, and does not replace, any existing Overshield, but a character cannot have more Overshield than half its Maximum HP. If the Overshield had effects, it can inherit those effects, but only the effects of one system at a time (you can choose which is kept or replaced).</p>",
          "weapon_types": [],
          "weapon_sizes": [],
          "system_types": [
            "Shield"
          ]
        }
      ],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://cdn.discordapp.com/attachments/984628782109425664/1005213478669262918/KIE_ScarabFinalNoBG.png",
    "y_pos": "36"
  },
  {
    "id": "kie_weevil",
    "source": "KIE",
    "license_level": 2,
    "name": "WEEVIL",
    "mechtype": [
      "Support"
    ],
    "description": "<div>The KIE Weevil performs a valuable role in both civilian and military matters: on-demand salvage and scrapping. Designed around a “nest” of nanites and drones, the Weevil is capable of recycling raw and manufactured materials at high efficiency. On a battlefield, it can act as a depository of spare parts, and is capable of flash-fabricating replacements for equipment if supply chains are not available, though it has to dedicate its systems to that task, a dangerous proposition on the battlefield.</div><div>Within the Rubble, Weevils perform a large variety of tasks to maintain high efficiency all through the colony, thanks to their abilities and cooperation. This leaves the Weevils with a larger amount of free time when compared to other Cadres; which, in the best cases, has led the Rubbleborn to incredible leaps in technological development. Weevil Cadres present the largest variety within them, ranging from technical roles like science and engineering, while others fulfill cultural roles like arts, companionship, recreational efforts.</div><div>To other Rubbleborn, Weevil are always welcome as friends and helpful hands, but to outsiders, they are met with mixed emotions. Their innate drive to fix and repurpose components can evolve into kleptomaniac tendencies, and although the Rubbleborn are happy to trade trinkets with them to satiate this desire, JXC and Union materials tend to go missing when a Weevil is nearby, as they simply can't resist but grab new shinnies whenever they find them.</div>",
    "mounts": [
      "Flex"
    ],
    "stats": {
      "size": 0.5,
      "structure": 4,
      "stress": 4,
      "armor": "1",
      "hp": "6",
      "evasion": "10",
      "edef": "10",
      "heatcap": "5",
      "repcap": "2",
      "sensor_range": 10,
      "tech_attack": 0,
      "save": "11",
      "speed": "5",
      "sp": "8"
    },
    "traits": [
      {
        "name": "What's Yours Is Mine",
        "use": "",
        "description": "<div>Gain the Salvage reaction.</div>",
        "actions": [
          {
            "name": "Salvage",
            "activation": "Reaction",
            "detail": "<div>The Weevil gains 1 Repair. Additional Repairs gained in this way can exceed the Weevil’s Repair Capacity and last until used or until a Full Repair.</div><div>This special reaction can be used once a turn, any number of times a round, and doesn’t count against the maximum number of reactions a turn, so the Weevil can take other reactions normally.</div>",
            "pilot": false,
            "synergy_locations": [],
            "tech_attack": false,
            "frequency": "1/round",
            "init": "<div></div>",
            "trigger": "<div>An hostile character within sensor range is destroyed or takes structure damage.</div>"
          }
        ]
      },
      {
        "name": "What's Mine Is Yours",
        "use": "",
        "description": "<div>During Rests, allied characters may use the Weevil’s repair capacity as if it was their own.</div>"
      },
      {
        "name": "Little Helper",
        "use": "",
        "description": "<div>As a Quick Action, the Weevil may Attach itself to a valid ally.</div>",
        "actions": [
          {
            "name": "Little Helper",
            "activation": "Quick",
            "detail": "<div>The Weevil Attaches itself to a willing, adjacent, allied character.</div>",
            "pilot": false,
            "synergy_locations": [],
            "tech_attack": false,
            "frequency": "Unlimited",
            "init": "",
            "trigger": ""
          }
        ]
      }
    ],
    "core_system": {
      "name": "Onboard Salvage Kit",
      "active_name": "Finders' Keepers",
      "active_effect": "<p>For the rest of the Scene, the “Salvage” reaction's limitation becomes 1/turn, rather than 1/round.</p>",
      "activation": "Protocol",
      "description": "<p><em>The Weevil’s onboard nanite vat is designed to assist in reclamation of equipment and repurposing it in the field. Multi-spectrum sensors passively analyze nearby pieces of machinery, but can be directed to seek out equipment within a predesignated threshold.</em></p><p><em>Unfortunately, its primary drive of salvage can lead to its pilots developing some level of unintentional kleptomania. Mining crews are advised to keep an eye on valuables that might go missing and a dedicated supply log of existing stocks in case something gets “appropriated”.</em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "Whatever Works, Works.",
      "passive_effect": "<p>The Weevil may expend 2 Repairs instead of a charge when activating a Limited System or Weapon.</p><p>While Attached to another character, the host may benefit from this trait at the Weevil’s discretion.</p>",
      "passive_actions": [],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://cdn.discordapp.com/attachments/984628782109425664/1005213479055143054/KIE_WeevilFinalNoBG.png",
    "y_pos": "19"
  },
  {
    "id": "kie_firefly",
    "source": "KIE",
    "license_level": 2,
    "name": "FIREFLY",
    "mechtype": [
      "Striker"
    ],
    "description": "<div>Designed primarily as a mining platform, the Firefly is derived in part from the Harrison Armory Sherman and Genghis chassis, though heavily-modified. However, lack of access to the technologies used to regulate those mechs’ reactors caused the Firefly’s to become relatively unstable under stress. Ever-resourceful, the Rubblefolk that founded KIE decided to “double-down”, allowing the machine to utilize its reactor to melt objects and shield itself. Its effectiveness is only matched by its danger that it poses to its pilot.</div><div>The Firefly itself acts as an ore processor in mining operations, melting down and filtering collected material into more manageable chunks and blocks. Their ability to endure heavy amounts of heat also sees Fireflies operating as blacksmiths in the manufacturing forges of Rubbleborn colonies, with entire cadres of Fireflies nonchalantly walking around and through the massive furnace assemblies as they help build the vital supplies necessary for the colony to operate.</div>",
    "mounts": [
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": "1",
      "hp": "8",
      "evasion": "8",
      "edef": "7",
      "heatcap": "4",
      "repcap": "4",
      "sensor_range": "8",
      "tech_attack": "-1",
      "save": "11",
      "speed": "5",
      "sp": 6
    },
    "traits": [
      {
        "name": "FEED THE FORGE",
        "use": "",
        "description": "<div>Taking Burn damage or failing to clear Burn cannot reduce the Firefly’s HP below 1.</div>",
        "synergies": [
          {
            "locations": [
              "hp"
            ],
            "detail": "<div>Taking Burn damage or failing to clear Burn cannot reduce the Firefly’s HP below 1.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": []
          }
        ]
      },
      {
        "name": "PLAYING WITH FIRE",
        "use": "",
        "description": "<div>When the Firefly succeeds on an Engineering Check to clear Burn, it may opt to keep the Burn without taking damage.</div>",
        "synergies": [
          {
            "locations": [
              "engineering"
            ],
            "detail": "<div>When the Firefly succeeds on an Engineering Check to clear Burn, it may opt to keep the Burn without taking damage.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": []
          }
        ]
      },
      {
        "name": "MOLTEN VEINS",
        "use": "",
        "description": "<div>when the Firefly takes or clears any amount of Heat from its own Systems, Talents, or Weapons, it may elect to replace some or all of it with Burn, clearing or taking it instead of Heat.</div><div>Additionally, when it melts down or self-destructs, the Firefly deals Burn instead of Explosive Damage.</div>",
        "synergies": [
          {
            "locations": [
              "heat"
            ],
            "detail": "<div>when the Firefly takes or clears any amount of Heat from its own Systems, Talents, or Weapons, it may elect to replace some or all of it with Burn, clearing or taking it instead of Heat.</div><div>Additionally, when it melts down or self-destructs, the Firefly deals Burn instead of Explosive Damage.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": []
          }
        ]
      }
    ],
    "core_system": {
      "name": "TYPE-43 FUSION FURNACE",
      "active_name": "Stoke the Flames",
      "active_effect": "<p>When the Firefly activates this core system, it momentarily overloads its reactor, feeding inmense amounts of energy into the Type-43 Fusion Furnace, allowing it to perform one of the following techniques: Second Sun Of Jovo, Meteor Shower or Thermal Well.</p><p>This action is Efficient, and refunds 1 Core Power at the end of any scene in which it’s used.<p/>",
      "activation": "Protocol",
      "description": "<p><em>The Type-43 Fusion Furnace is built off prototypes of “hot fusion” reactors used by the Rubblefolk early in their history, along with Harrison Armory’s own reactor technologies. While they currently have switched to geothermal power, the output of the Fusion Furnace is extremely high; perhaps a bit too high for even its mech to handle, giving it the nickname “The Second Sun of Jovo”. The Fusion furnace can be used to flash-fabricate short-duration equipment in the field, allowing the Firefly excellent endurance at the cost of possible danger to the pilot.</em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [
        {
          "name": "Second Sun Of Jovo (All Burn)",
          "activation": "Full",
          "detail": "<p>As a Full Action, the Firefly erupts into a Burst 3 explosion of intense flames. All characters of its choice within that area must make an Engineering Save or take Burn equal to the Firefly’s current Burn. On a success, they take half Burn instead. The Firefly then becomes Stunned until the end of its next turn.</p>",
          "cost": 0,
          "pilot": false,
          "damage": [],
          "range": [],
          "synergy_locations": [],
          "tech_attack": false,
          "frequency": "Unlimited",
          "init": "",
          "trigger": ""
        },
        {
          "name": "Meteor Shower (9 Burn)",
          "activation": "Full",
          "detail": "<p>As a Full Action, the Firefly unleashes a torrent of concentrated plasma, causing it to explode on a Burst 2 sphere of solar flames centered on a point within range 10. The Firefly does not require line of sight to the targeted area as long as it is possible to trace a path to it. Characters in the affected area must make an Agility Save, taking 9 Burn on a fail, or half as much on a pass.</p>",
          "cost": 0,
          "pilot": false,
          "damage": [],
          "range": [],
          "synergy_locations": [],
          "tech_attack": false,
          "frequency": "Unlimited",
          "init": "",
          "trigger": ""
        },
        {
          "name": "Thermal Well (9 Burn)",
          "activation": "Full",
          "detail": "<p>As a Full Action, the Firefly releases a wave of radiance that empowers allied characters within Burst 2 area. Allied characters empowered by the burst of thermal energy gain 4 Overshield and the first attack they make before the end of their next turn deals +3 bonus energy damage on a hit. </p>",
          "cost": 0,
          "pilot": false,
          "damage": [],
          "range": [],
          "synergy_locations": [],
          "tech_attack": false,
          "frequency": "Unlimited",
          "init": "",
          "trigger": ""
        }
      ],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "START THE FIRE",
      "passive_effect": "<p>As the Firefly becomes engulfed in flames, its Fusion Furnace gains raw materials to spend on additional Techniques. Each Technique has a listed Action and Burn cost, the Firefly must be suffering from Burn equal to or higher than the listed amount to use an Action, and after using them, the Firefly clears the listed amount of Burn:</p>",
      "passive_actions": [
        {
          "name": "Molten Drill (Any Burn)",
          "activation": "Free",
          "detail": "<p>When the Firefly performs an improvised attack, it can use a free action to deal bonus Burn on a hit equal to the Burn cleared by this action.</p>",
          "cost": 0,
          "pilot": false,
          "damage": [],
          "range": [],
          "synergy_locations": [],
          "tech_attack": false,
          "frequency": "Unlimited",
          "init": "",
          "trigger": ""
        },
        {
          "name": "Iron Skin (Any Burn)",
          "activation": "Quick",
          "detail": "<p>As a Quick Action, the Firefly clears any amount of Burn and convert it into an equal amount of Overshield, up to 3+Grit. </p>",
          "cost": 0,
          "pilot": false,
          "damage": [],
          "range": [],
          "synergy_locations": [],
          "tech_attack": false,
          "frequency": "Unlimited",
          "init": "",
          "trigger": ""
        },
        {
          "name": "Fire Breath (5 Burn)",
          "activation": "Quick",
          "detail": "<p>As a Quick Action, the Firefly can force characters in a Cone 5 zone to make an Agility Save, on a fail they take 5 Burn and are pushed 2 spaces away from the Firefly. On a Success they take 3 Burn and are not pushed.</p>",
          "cost": 0,
          "pilot": false,
          "damage": [],
          "range": [],
          "synergy_locations": [],
          "tech_attack": false,
          "frequency": "Unlimited",
          "init": "",
          "trigger": ""
        },
        {
          "name": "Solar Whip (5 Burn)",
          "activation": "Quick",
          "detail": "<p>As a Quick Action, the Firefly forces a character within range 8 to make a Hull save, taking 5 Burn and falling prone on a fail. On a success they take 3 Burn and are not knocked Prone.</p>",
          "cost": 0,
          "pilot": false,
          "damage": [],
          "range": [],
          "synergy_locations": [],
          "tech_attack": false,
          "frequency": "Unlimited",
          "init": "",
          "trigger": ""
        },
        {
          "name": "Flame Slide (5 Burn)",
          "activation": "Quick",
          "detail": "<p>As a Quick Action, the Firefly may Boost, ignoring engagement, reactions, difficult terrain, and dangerous terrain. The Firefly can move through spaces occupied by hostile characters but not end its turn within them. After moving, the Firefly gains Soft Cover until the end of its next turn.</p>",
          "cost": 0,
          "pilot": false,
          "damage": [],
          "range": [],
          "synergy_locations": [],
          "tech_attack": false,
          "frequency": "Unlimited",
          "init": "",
          "trigger": ""
        }
      ],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://cdn.discordapp.com/attachments/984628782109425664/1013140429648187483/KIE_FireflyFinalNoBG.png",
    "y_pos": "10"
  },
  {
    "id": "kie_stag",
    "source": "KIE",
    "license_level": 2,
    "name": "STAG",
    "mechtype": [
      "Defender",
      "Controller"
    ],
    "description": "<div>Taking its name from its industrial-grade pincers, the KIE Stag is primarily designed for cargo transportation and moving of heavy objects, despite its size. Early designs of the Stag served as militia mechs for the Rubblefolk, even prior to its combat refit, as they were strong and durable.</div><div>Stags often serve as assistants to larger machines or vehicles, deployed as demolition clean-up crews, but their surprising resilience also allows them to operate in a bodyguard capacity. The mech’s legs end in magnetic clamps, which lets it travel on the back of its charge, acting as a shield and interception system.</div><div>Its symbiotic role is often employed alongside Hercules mining rigs, where the larger frame can focus on excavation and transport duties, while groups of Stags serve auxiliary roles ranging from clearing debris, simple maintenance and area security, often being referred to as \"Bulls\", \"Metals\" and \"Hounds\" respectively. Their bond is so deep that Stags tend to adopt the batch-name of the Hercules as their own, and it is very rare to find one without the other.</div> ",
    "mounts": [
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 0.5,
      "structure": 4,
      "stress": 4,
      "armor": "3",
      "hp": "6",
      "evasion": "8",
      "edef": 6,
      "heatcap": "4",
      "repcap": "4",
      "sensor_range": "5",
      "tech_attack": "-2",
      "save": "11",
      "speed": "3",
      "sp": 6
    },
    "traits": [
      {
        "name": "Little Guardian",
        "use": "",
        "description": "<div>As a Quick Action, the Stag can ATTACH itself onto a valid allied character. When the Stag Grapples or Rams, it may add its host’s size to its own.</div>",
        "actions": [
          {
            "name": "Little Guardian Ride",
            "activation": "Quick",
            "detail": "<div>The Stag ATTACHES itself onto a valid allied character. When the Stag Grapples or Rams, it may add its host’s size to its own.</div>",
            "pilot": false,
            "synergy_locations": [],
            "tech_attack": false,
            "frequency": "Unlimited",
            "init": "",
            "trigger": ""
          }
        ]
      },
      {
        "name": "Hard to Bite",
        "use": "",
        "description": "<div>The Stag has resistance to damage dealt by Melee attacks.</div>"
      },
      {
        "name": "Deployable Handholds",
        "use": "",
        "description": "<div>The Stag's Melee weapons gain EUSOCIAL.</div>",
        "synergies": [
          {
            "locations": [
              "weapon"
            ],
            "detail": "<div>The Stag's Melee Weapons gain EUSOCIAL.</div>"
          }
        ]
      }
    ],
    "core_system": {
      "name": "DETRITUS COMPACTOR",
      "active_name": "Iron Curtain",
      "active_effect": "<p>For the rest of the Scene, Blade-Breaker gains the following benefits:</p><ul><li><p>The Stag may take the reaction up to 3/round.</p></li></ul><ul><li><p>The target of the triggering attack gains resistance to all damage, heat and burn dealt by that attack.</p></li></ul><ul><li><p>The attacker takes 2 heat before the attack resolves, and an additional 2 AP kinetic damage if they fail the contested check.</p></li></ul>",
      "activation": "Quick",
      "description": "<p><em>The massive mandibular apparatus of the Stag is capable of lifting objects heavier than itself, and specialized servomotors and artificial muscles give it extremely quick response and clamp times. Stag pilots were able to develop a technique for this characteristic, designated the “Blade-breaker”, which can intercept incoming melee weaponry and use an attacker’s mass against them. This has proven to be a lifesaver for many caravans and mining crews alike when faced by territorial megafauna.</em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "Stout and Stubborn",
      "passive_effect": "<p>Gain the Blade-Breaker Reaction.</p>",
      "passive_actions": [
        {
          "name": "Blade-Breaker",
          "activation": "Reaction",
          "detail": "<p>Force the attacker to make a contested Hull check. If the Stag wins, it may choose one of the following effects, which resolves before the triggering attack:</p><ul><li><p>The Attacker is pulled directly towards the Stag and becomes Grappled by it.</p></li></ul><ul><li><p>The Stag may automatically hit the Attacker with a Ram attack. </p></li></ul><p>If forced movement caused by this reaction would leave the target of the triggering attack out of their weapon's threat or range, the attack automatically misses and the action is wasted.</p>",
          "cost": 0,
          "pilot": false,
          "damage": [],
          "range": [],
          "synergy_locations": [],
          "tech_attack": false,
          "frequency": "1/round",
          "init": "",
          "trigger": "<p>The Stag or an adjacent ally is targeted by a melee attack.</p>"
        }
      ],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://cdn.discordapp.com/attachments/984628782109425664/1015480028022186034/KIE_StagFinalNoBG.png",
    "y_pos": "42"
  },
  {
    "id": "kie_longhorn",
    "source": "KIE",
    "license_level": 2,
    "name": "LONGHORN",
    "mechtype": [
      "Support",
      "Defender"
    ],
    "description": "<div>When the Rubbleborn were exposed to the outside world, their communal nature led to several incidents of culture shock. One such infamous occurrence was the introduction of the ancient game of “Chess” to their knowledge. Being Rubbleborn, they decided that the way to play was to have each individual piece controlled by a single individual. Because of this, a specialized communications relay was required to process and execute the specific requests of each person.</div><div>As their mining efforts expanded and grew more complex, this relay was brought into industrial-grade specifications and mounted in a chassis, purpose-built for such a role. Known as the “Longhorn”, this chassis provides communications and ECM capabilities unrivaled by almost any other model.</div>",
    "mounts": [
      "Flex"
    ],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": "8",
      "evasion": "8",
      "edef": "12",
      "heatcap": "5",
      "repcap": "4",
      "sensor_range": "20",
      "tech_attack": "0",
      "save": "10",
      "speed": "5",
      "sp": "10"
    },
    "traits": [
      {
        "name": "Gospel",
        "use": "",
        "description": "<div>The Longhorn’s Tech Systems gain the Eusocial Tag. </div>",
        "synergies": [
          {
            "locations": [
              "system"
            ],
            "detail": "<div>The Longhorn’s Tech Systems gain the Eusocial Tag. Additionally, the Longhorn can use a tech action as if it had a range of Hivemind at the cost of 1 heat.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": [
              "Tech"
            ]
          }
        ]
      },
      {
        "name": "Hive Taleteller",
        "use": "",
        "description": "<div>Gain the \"Spread the Word\" reaction.</div>",
        "actions": [
          {
            "name": "Spread the Word",
            "activation": "Reaction",
            "detail": "<div>The Longhorn applies the same tech action to all allied characters adjacent to the triggering character.</div>",
            "pilot": false,
            "synergy_locations": [],
            "tech_attack": false,
            "frequency": "1/encounter",
            "init": "",
            "trigger": "<div>The Longhorn or an adjacent ally benefits from a tech action.</div>"
          }
        ]
      },
      {
        "name": "Echoing Decree",
        "use": "",
        "description": "<div>The Longhorn can use a tech action as if it had a range of Hivemind at the cost of 1 heat.</div>",
        "synergies": [
          {
            "locations": [
              "system"
            ],
            "detail": "<div>The Longhorn can use a tech action as if it had a range of Hivemind at the cost of 1 heat.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": [
              "Tech"
            ]
          }
        ]
      }
    ],
    "core_system": {
      "name": "\"Hivespeaker\" Relay Node",
      "active_name": "Blessed Be The Tales We Tell",
      "active_effect": "<p>When Activated, the Longhorn chooses any number of characters within HiveMind range and applies Hallow to them.</p>",
      "activation": "Quick",
      "description": "<p><em>The Hivespeaker Relay node makes use of specialized e-warfare commands worked into a locked loop. This modified code, when unshackled, is able to pierce almost all electronics within a close radius thanks to its relative simplicity; allowing sabotage and reinforcement when needed, alongside the versatility of being able to switch between these polarized strings of code.</em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "Binary Hallow",
      "passive_effect": "<p></p>",
      "passive_actions": [
        {
          "name": "Binary Hallow",
          "activation": "Quick Tech",
          "detail": "<p>When activated, choose a character within sensor range and line of sight to apply Hallow on them. Hallow can be consumed when you or an ally targets the Hallowed character with a tech action, clearing Hallow and applying an additional effect. This effect varies if the character is hostile or allied.</p><ul><li><p><strong>Zeal:</strong> If the Hallowed character is hostile, clearing Hallow on them allows the triggering character to apply an Invade option on their target.</p></li></ul><ul><li><p><strong>Serenity:</strong> If the Hallowed character is an ally, consuming Hallow on them allows them to clear one condition that wasn’t caused by their own systems, weapons, talents, etc.</p></li></ul>",
          "cost": 0,
          "pilot": false,
          "damage": [],
          "range": [],
          "synergy_locations": [],
          "tech_attack": false,
          "frequency": "Unlimited",
          "init": "",
          "trigger": ""
        }
      ],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://cdn.discordapp.com/attachments/984628782109425664/1012892866437189673/Longhorn.png",
    "y_pos": "27"
  },
  {
    "id": "kie_hercules",
    "source": "KIE",
    "license_level": 2,
    "name": "HERCULES",
    "mechtype": [
      "Artillery"
    ],
    "description": "<div>Based off a combination of massive tunneling rigs downscaled for combat use and a displaced wreck of a ZBG7 “Quake” model of Harrison Armory’s “Barbarossa” Frame found in the time crystal caverns, the Hercules carries a large amount of firepower compared to other KIE offerings, used to excavate mineshafts extremely quickly.</div><div>That belies its secondary purpose as a mobile command center and base of operations for mining teams. Its large size allows it to host a powerful sensor package and multiple servers for short-range HiveMinds, along with an array of COMP/CON programs and HiveMind Entities for optimization and logistical use. Due to its more insectoid appearance, Rubbleborn pilots of the machine are often found to develop a sense of detachment which, combined with the increased interaction with COMP/CON units, can lead to a sense of a disconnect between their core elements.</div><div>Non-Rubbleborn pilots are warned to look out for signs that they might be developing similar sorts of psychological occurrences, and to seek counseling as soon as possible to process the overwhelming amount of information piloting the frame can provide.</div>",
    "mounts": [
      "Flex",
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 3,
      "structure": 4,
      "stress": 4,
      "armor": "1",
      "hp": 10,
      "evasion": 6,
      "edef": "9",
      "heatcap": "5",
      "repcap": "5",
      "sensor_range": "15",
      "tech_attack": 0,
      "save": "10",
      "speed": "2",
      "sp": "7"
    },
    "traits": [
      {
        "name": "Demolition Computer",
        "use": "",
        "description": "<div>When the Hercules makes a Line, Cone, Blast or Burst attack, it can choose any number of characters or objects in the affected area to grant them immunity to the attack’s damage, heat, conditions and other additional effects.</div>"
      },
      {
        "name": "Walking Fortress",
        "use": "",
        "description": "<div>Allied Characters may use the Hercules for Hard Cover. Additionally, the Hercule’s weapons gain the “Eusocial” Tag, but any of its weapons used this way draw Line of Sight and Range from the Hercules.</div>",
        "synergies": [
          {
            "locations": [
              "weapon"
            ],
            "detail": "<div>The Hercule’s weapons gain the “Eusocial” Tag, but any of its weapons used this way draw Line of Sight and Range from the Hercules.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": []
          }
        ]
      },
      {
        "name": "Too Big To Care",
        "use": "",
        "description": "<div>The Hercules can’t be pushed, pulled, knocked Prone, or knocked back by smaller characters. Additionally, the Hercules has +1 ACC on Checks and Saves against being knocked Prone or Knocked Back, and any Knockback taken is halved.</div>"
      }
    ],
    "core_system": {
      "name": "\"ROCKBREAKER\" SUBLAUNCHERS",
      "active_name": "SEISMIC QUAKE PAYLOADS",
      "active_effect": "<p>For the rest of the Scene, Submunition Burst’s heat cost can be ignored. Additionally, 1/round, the Hercules can increase the damage dealt by a Line, Cone, Burst or Blast attack by 2 for each target beyond the first.</p>",
      "activation": "Quick",
      "description": "<p><em>Equipped with a 360-degree range system of plasma launchers across the entire frame, the Hercules is able to deliver additional power during its artillery barrages. The customizable payloads allow the Hercules to deliver a flexible and customizable range of cover fire.</em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "Submunition Burst",
      "passive_effect": "<p>1/round, when making a Line, Cone, Blast or Burst attack, the Hercules can take 2 Heat to increase the size of the affected area. The area increase depends on the attack type:</p><p>Blast or Burst: +1<br>Cone: +2<br>Line: Up to +5</p>",
      "passive_actions": [],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://cdn.discordapp.com/attachments/984628782109425664/1005213478191104143/KIE_HerculesFinalNoBG.png",
    "y_pos": "46"
  },
  {
    "id": "Kie_Beetle",
    "source": "GMS",
    "license_level": 0,
    "name": "Beetle",
    "mechtype": [
      "Support"
    ],
    "description": "<div>The BEETLE is a support GMS chassis co-developed by the Rubble that all characters have access to from LL0 onwards. This variant FRAME is not mutually exclusive with the EVEREST.</div><div>The Beetle platform was introduced as a method to better assist the new generation of Rubbleborn created following contact with the outside world. As part of Union’s aid package, GMS provided schematics and components that could be integrated with ease. Development would start on building a new frame by the Rubblefolk, and the resulting “Beetle” would become the standard-issue “starter body” for Rubbleborn, replacing many previously-specialized bodies that were now ancient and obsolete designs. By 5090u, not even two years after it first rolled out of the assembly forges, the Beetle would make up the vast majority of the juvenile population within The Rubble. It later served as the basis for the Scarab platform, its larger sibling, following the establishment of KIE. All Beetles are customized in some way and to different degrees: some are completely unrecognizable as Beetles, their endo- and exoskeletal structures modified so drastically that they are almost a separate platform, but GMS-standard components means that they can be rapidly replaced and interchanged when the need calls for it, something the Rubbleborn very much appreciate.</div><div>While its hardpoints are designed for tool integration, field refits can allow weapons to be mounted instead, and peripheral access ports allow Beetles to share their equipment with others. Short-range temporary “nest-minds” are able to share, broadcast, and assist in reacting to data of incoming situations, often autonomously alerting older or more powerful members of a colony to their peril.</div><div>Following its success in the Rubble, a deal would be struck up with GMS to license it across Union space, adapted for use by non-Rubbleborn. While not technically a product of the Off-World Division, and predating Khepri Industrial Equipment, it is included in the catalog due to its nature as a jointly-developed project.</div>",
    "mounts": [
      "Main",
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 0.5,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": "8",
      "evasion": "8",
      "edef": "8",
      "heatcap": 6,
      "repcap": "4",
      "sensor_range": 10,
      "tech_attack": 0,
      "save": "10",
      "speed": 4,
      "sp": "8"
    },
    "traits": [
      {
        "name": "Replaceable Parts",
        "use": "",
        "description": "<div>While resting, the Beetle can be repaired at a rate of 1 Repair per 1 structure damage, instead of 2 Repairs.</div>",
        "synergies": [
          {
            "locations": [
              "structure",
              "repair"
            ],
            "detail": "<div>While resting, the Beetle can be repaired at a rate of 1 Repair per 1 structure damage, instead of 2 Repairs.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": []
          }
        ]
      },
      {
        "name": "Companionship",
        "use": "",
        "description": "<div>Allied characters adjacent to the Beetle can roll all saves and checks twice and choose either result.</div>"
      },
      {
        "name": "Metamorphosis",
        "use": "",
        "description": "<div>When printed or after a full repair, the Beetle can increase its size to 1, or reduce it back to 1/2.</div>"
      }
    ],
    "core_system": {
      "name": "Peripheral Access Ports",
      "active_name": "Remote Control",
      "active_effect": "<p>For the Rest of the scene, all of your weapons and systems gain EUSOCIAL.</p><p>When an allied character uses one of your Eusocial Weapons or Systems in this manner, you may take 1 Heat as a reaction to give them +1 ACC on attack rolls made with your weapons or to inflict +1 DIFF on checks and saves forced by these or Systems.</p>",
      "activation": "Quick",
      "description": "<p><em>\"The little guys have a lot of potential, but they rarely manage to make use of it on their own. When they realize this, they embody the principles of the Rubbleborn. A group of Beetles can accomplish almost anything if they put their minds together, and their conjoined flow of ideas could overwhelm even the wisest of our people, but they somehow manage to turn those excited thoughts into functional concepts. That is how Cadres are born, and without them, Rubble would have turned to dust a long time ago.\" -Ximon Wayde, Rubblefolk Hivespeaker. </em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "",
      "passive_effect": "",
      "passive_actions": [],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "",
    "y_pos": 0
  },
  {
    "id": "kie_Pillbug",
    "source": "IPS-N",
    "variant": "NELSON",
    "license_level": 2,
    "name": "Pillbug",
    "mechtype": [
      "Striker",
      "Controller"
    ],
    "description": "<div>This variant of the Nelson can be taken at rank II of the NELSON license instead of the base Frame, or gained as exotic gear through play.</div><div>The KIE-OWD Pillbug originally started life as an up-armored Nelson variant, replacing the armor plating with a malleable deterrence field, a thought experiment by Rubbleborn engineers to find novel methods in combating pirate boarding parties. Originally just theoretical, an intercepted shipment from a nearby mining colony would see the Rubbleborn there utilize the Pillbug in combat, where it proved to be a promising design.</div><div>Following negotiations with the mining colony, the newly-founded Off-World Division (OWD) of KIE decided to start collaborating with other manufacturers. In a show of good faith, the Pillbug’s schematics were sent to IPS-N proper. Following collaborative refinements, including an outside-of-the-box repurposing of the Nelson’s null-k plating and perpetual motion drive to be focused on what was around the mech, rather than what was inside of it.</div><div>The Pillbug primarily specializes as a demolition mech in the KIE catalog, taking the role of a mobile wrecking ball.</div>",
    "mounts": [
      "Main/Aux",
      "Flex"
    ],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": "1",
      "hp": "8",
      "evasion": "10",
      "edef": 6,
      "heatcap": "7",
      "repcap": "4",
      "sensor_range": "3",
      "tech_attack": "-2",
      "save": "11",
      "speed": "5",
      "sp": 6
    },
    "traits": [
      {
        "name": "All-Terrain Segmented Chitin",
        "use": "",
        "description": "<div>The Pillbug can Roll Up.</div>",
        "actions": [
          {
            "name": "Roll Up",
            "activation": "Quick",
            "detail": "<div>The Pillbug rolls up. While rolled up:</div><div>- It becomes immune to the Slowed condition, but it becomes unable to make ranged or tech attacks</div><div>- All knockback it deals or takes is increased by 1</div><div>- It gains 2 + Grit Overshield</div>",
            "pilot": false,
            "synergy_locations": [],
            "tech_attack": false,
            "frequency": "Unlimited",
            "init": "",
            "trigger": ""
          },
          {
            "name": "Unroll",
            "activation": "Protocol",
            "detail": "<div>The Pillbug unrolls, losing any Overshield gained from Roll Up.</div>",
            "pilot": false,
            "synergy_locations": [],
            "tech_attack": false,
            "frequency": "Unlimited",
            "init": "",
            "trigger": ""
          }
        ]
      },
      {
        "name": "Explosive Impact",
        "use": "",
        "description": "<div>If the Pillbug moves at least 5 spaces in a straight line before hitting a character with a melee attack, it may Ram them as a free action immediately after the attack, but before any Knockback is resolved. On hit, this Ram deals 1d6 Explosive Damage and knocks the target away 1 additional space.</div>",
        "synergies": [
          {
            "locations": [
              "ram",
              "weapon"
            ],
            "detail": "<div>If the Pillbug moves at least 5 spaces in a straight line before hitting a character with a melee attack, it may Ram them as a free action immediately after the attack, but before any Knockback is resolved. On hit, this Ram deals 1d6 Explosive Damage and knocks the target away 1 additional space.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": []
          }
        ]
      }
    ],
    "core_system": {
      "name": "Null-K Redirection Engine",
      "active_name": "Crash Landing",
      "active_effect": "<p>The Pillbug quickly ramps up in speed to perform a mighty jump before crashing down. Unless Immobilized, it jumps to a space within range 10, ignoring reactions, engagement and creating a tremor in a Burst 2 zone when it lands.</p><p>Objects and pieces of terrain in the affected area take 30 AP kinetic damage, and the area becomes difficult terrain until the end of the scene. Characters in the affected area must make an Agility save or fall prone, and a Hull save, taking 2d6 kinetic damage on a fail, or half as much damage on a success.</p><p>The Pillbug then can jump up to another point within range 10, ignoring reactions and engagement, as the force of impact makes it bounce away. It can Roll Up as a part of this action.</p>",
      "activation": "Full",
      "description": "<p><em>\"This simple system allows the pillbug to generate more power on the move thanks to a set of modified servos that grant the joints incredible flexibility while in ambulatory mode, and help dissipate impacts along the shell’s surface while rolled up. In short, you roll up and you go fast.\" -IPS-N Engineering Team notes on Project Pillbug. </em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "",
      "passive_effect": "",
      "passive_actions": [],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://cdn.discordapp.com/attachments/1045770818602422302/1058096233819942912/PillBug.png",
    "y_pos": "53"
  },
  {
    "id": "kie_Ghost_Mantis",
    "source": "SSC",
    "variant": "MOURNING CLOAK",
    "license_level": 2,
    "name": "Ghost Mantis",
    "mechtype": [
      "Striker",
      "Controller"
    ],
    "description": "<div>This variant of the Mourning Cloak can be taken at rank II of the MOURNING CLOAK license instead of the base Frame, or gained as exotic gear through play.</div><div>Thanks to a massive bounty paid to first-generation Rubblefolk lancers, a deal was struck with high-level SSC officials. In exchange for exotic underground materials, SSC was glad to add KIE-OWD to their list of licensed 3rd-party designers. The pristine frames sent to Rubble as reference models ended up scrapped or covered with sandstorm dust; their flexible platings, cloaking devices and fine blades finding use with the more reserved members of the colony. These would end up in use in an experimental research-and-development project in integrating “time crystals” harvested from Jovo and EX Slipstream Drive technologies, designated BLACK CARPET. By using a specialized chrono-crystalline control device, the BLACK CARPET project was capable of entering a parallel dimension to blinkspace. The unfortunate result of this was that this post-causality pocket led to a breakdown in any paracausal technologies due to incompatibilities, and the original test pilots would become stranded beyond the passage of time. While rescue attempts have been undertaken, none have been successful. Refinements would allow a temporary bubble of realspace and blinkspace to be preserved around the generator through adapted Aunic technologies, though this would leave a “shadow”. While difficult to replace and maintain, this “Shadowplay Generator” would be put into limited production, integrated with other BLACK CARPET technologies. The end result would be the Ghost Mantis.</div><div>Prior to the completion of the BLACK CARPET project, “Ghost Mantis” was merely a name given to the groups that make scouting efforts of the massive tunnel systems, fending off invasive megafauna with concealed skirmishes that might last days at a time, as they take out the pack leaders before picking off each individual until none are left and the tunnels are secure again. The chassis was named after these cadres, and given to the most elite of them, where they proved their worth in eliminating a surge of Typhonic megafauna that could have ravaged the largest Ambrosia harvesting field for the Rubble.</div>",
    "mounts": [
      "Main/Aux",
      "Flex"
    ],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": "8",
      "evasion": "10",
      "edef": "7",
      "heatcap": "5",
      "repcap": "3",
      "sensor_range": 10,
      "tech_attack": 0,
      "save": "10",
      "speed": "5",
      "sp": 6
    },
    "traits": [
      {
        "name": "Ambush Hunter",
        "use": "",
        "description": "<div>1/round, the Ghost Mantis may reroll a melee attack if the target has no adjacent characters or if the Ghost Mantis is the only adjacent character. It must use the second result.</div>",
        "synergies": [
          {
            "locations": [
              "weapon",
              "ram",
              "grapple",
              "improvised_attack"
            ],
            "detail": "<div>1/round, the Ghost Mantis may reroll a melee attack if the target has no adjacent characters or if the Ghost Mantis is the only adjacent character. It must use the second result.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": []
          }
        ]
      },
      {
        "name": "Trans-phasic Raptorials",
        "use": "",
        "description": "<div>While Intangible, the Ghost Mantis may still Grapple, Ram or make Improvised attacks against Tangible characters. If it Grapples a Tangible character, they also become Intangible for the duration of the grapple.</div>",
        "synergies": [
          {
            "locations": [
              "improvised_attack",
              "grapple",
              "ram"
            ],
            "detail": "<div>While Intangible, the Ghost Mantis may still Grapple, Ram or make Improvised attacks against Tangible characters. If it Grapples a Tangible character, they also become Intangible for the duration of the grapple.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": []
          }
        ]
      },
      {
        "name": "Horrifying Visage",
        "use": "",
        "description": "<div>1/round, when the Ghost Mantis loses Invisible, Intangible or Hidden, it can force one adjacent character of its choice to make a System save or become Jammed until the end of their next turn. A character can only become Jammed by this effect 1/scene.</div>"
      }
    ],
    "core_system": {
      "name": "Phantasm Cloak",
      "active_name": "Shadow Step",
      "active_effect": "<p>The Ghost Mantis teleports itself towards a point within range 25 and Hides.</p><p>If the Ghost is Grappling a character, it can forgo the Hide effect and instead teleports the Grappled character alongside them, as long as there’s enough free space for them at the destination. When a hostile character is teleported in this way, it becomes Shredded until the end of the Ghost Mantis’s next turn.</p><p>This action is Efficient, and refunds 1 Core Power at the end of any scene in which it’s used.</p>",
      "activation": "Quick",
      "description": "<p><em>\"They say Blackstone is haunted, ghosts and shit like that. Probably just the locals playing tricks with smoke and mirrors to keep bandits away from the underground farms.\" -Tadeus “Kickflip” Goldlock, JXC Ranger.</em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "Meld with the Shadows",
      "passive_effect": "<p>When the Ghost Mantis Hides, it may choose to also become Intangible and Slowed until the end of its next turn.</p>",
      "passive_actions": [],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://cdn.discordapp.com/attachments/1045770818602422302/1058096042916204574/Ghost_Mantis.png",
    "y_pos": "23"
  },
  {
    "id": "kie_Cicada",
    "source": "HORUS",
    "variant": "BALOR",
    "license_level": 2,
    "name": "Cicada",
    "mechtype": [
      "Defender",
      "Controller"
    ],
    "description": "<div>This variant of the Balor can be taken at rank II of the BALOR license instead of the base Frame, or gained as exotic gear through play.</div><div>Named after the notoriously-noisy bug species from Cradle, the Cicada was originally developed by a sect of Rubbleborn that decided to worship the Maker. Locating a cave of “time crystals”, they attempted to figure out how to travel back in time to prevent the destruction of their “deity”. The creation of the Cicada platform by this group of “Severed Servants” was unintentional; attempts to delve into the past drove the machine and biological minds that make up the Rubbleborn mad, reprogramming the nanite-cells that makes up their bodies into swarms of shapeless masses. The constant falling apart and reforming of their chassis’ components is extremely painful, where smaller techno-organisms crawl out of the mech’s plating and limbs dissolve into clouds.</div><div>Constantly surrounded by rogue nano-constructs, the Cicadas are a constant pain in the back of the more pacifist colonies like Rubble, and although direct conflict in these zones are rare, their pillaging attacks against Ambrosia harvests are always a looming threat that forces such groups to keep their guard up at all times. Still, some of these individuals have found peace, thanks to additional sub-minds installed on their frames to control the mass of nanites, while meditative routines reduce the pain from their constantly-shifting bodies. These “rehabilitated” Cicadas enjoy normal lives within the colonies, usually delegated as assistants to Longhorns, using their nanites to spread messages and extend the reach of the HiveMind.</div>",
    "mounts": [
      "Heavy",
      "Flex"
    ],
    "stats": {
      "size": 3,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": "8",
      "evasion": "8",
      "edef": "11",
      "heatcap": "4",
      "repcap": "3",
      "sensor_range": "8",
      "tech_attack": "1",
      "save": "10",
      "speed": 4,
      "sp": "8"
    },
    "traits": [
      {
        "name": "Shifting Swarm",
        "use": "",
        "description": "<div>While the Cicada isn’t Jammed, it gians the following benefits, which it may share with its deployed drones:</div><ul><li><div>Is Immune to being Grappled, but it can initiate a grapple as normal.</div></li><li><div>All critical hits scored against it become normal hits.</div></li><li><div>Can Hover when it moves.</div></li><li><div>Counts as having soft cover, even in the open.</div></li></ul>"
      },
      {
        "name": "Shapeless",
        "use": "",
        "description": "<div>Instead of tracking the position of an individual mech, the Cicada’s nanites are assumed to fly freely within the space it occupies. Other characters can freely move through and end their turn in spaces occupied by the Cicada, and as long as the Cicada occupies at least 1 free space it can move through or end its turn overlapping obstructions, cover, or other characters.</div>"
      },
      {
        "name": "Self-Perpetuating",
        "use": "",
        "description": "<div>At the end of a rest, the Cicada regains full HP automatically and without Repairs.</div>"
      }
    ],
    "core_system": {
      "name": "Legion Body",
      "active_name": "WE ARE LEGION",
      "active_effect": "<p>When activated, the Cicada enters a focusing state, where it starts to unleash nano-constructs at an alarming rate to form a ravenous storm within a Burst 1 area. This storm’s Burst size increases by 1 at the start of each of the Cicada’s turns, with no upper limit. Additionally, the following effects apply while active:</p><ul><li><p>The Cicada becomes Immobilized but gains immunity to knockback and all involuntary movement.</p></li><li><p>Ravenous Embrace applies to all hostile characters within the affected area, and characters completely within this area can be pushed 3 spaces in a direction of the Cicada's choice on a failed save, in addition to the Blinded condition.</p></li><li><p>The Cicada may use any free space within the storm’s Burst area to determine Line of Sight, Sensor Range, Threat, and Range for Weapon and Tech Attacks instead of its own.</p></li><li><p>Allies within the affected area gain the benefits of Shifting Swarm.</p></li></ul><p>This effect lasts until the end of the scene, but the Cicada can end this effect early as a protocol.</p>",
      "activation": "Full",
      "description": "<p><em>\"Their bodies are broken, but their minds can be fixed. They reveal unheard songs and unseen marvels when the pain stops. If you ever remind them of their suffering, they will make sure to integrate your voice into their chorus.\" -Serena “Odonata” Byrne, Rubblefolk Heartfixer. </em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "Ravenous Embrace",
      "passive_effect": "<p>1/round, when a hostile character ends their turn adjacent to the Cicada or one of its Drones, they may force them to make a Systems save or become Blinded until the end of their next turn.</p>",
      "passive_actions": [],
      "passive_bonuses": [],
      "passive_synergies": [],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://cdn.discordapp.com/attachments/1045770818602422302/1058095923118481438/Cicada.png",
    "y_pos": "33"
  },
  {
    "id": "kie_bombardier",
    "source": "HA",
    "variant": "GENGHIS",
    "license_level": 2,
    "name": "Bombardier",
    "mechtype": [
      "Controller",
      "Artillery"
    ],
    "description": "<div>This variant of the Genghis can be taken at rank II of the GENGHIS license instead of the base Frame, or gained as exotic gear through play.</div><div>Following contact with the outside world and the enhancement of their already-established industrial base, the Rubbleborn decided to use existing frames as testbeds. The first prototype of the Bombardier came out of this program as a specialized mining tool, using corrosive acids to dissolve rock into a softer slag substance, which other machines could more easily drill and collect. However, the acids- based on a compound created by combining the byproducts of a burrowing worm species with a lithovore microbe strain, designated \"Substance 07 / MCB\"- had to be diluted with a synthetic chemical to get any sort of large batch, and the process used made it unstable. Multiple prototypes underwent a spontaneous collapse as the acid tanks ate themselves from inside-out, and the project was shelved for the time being.</div><div>When the legal battle against Lysenko-Rasolka Limited was finished, Harrison Armory reached out to provide technical support in an attempt to obtain the resources of the Rubble some other way. Providing expertise in reactor confinement, and sharing data on their Genghis platform, additional systems were designed to stabilize and optimize Substance 07/MCB through a novel mixing chamber, providing a \"chemical furnace\". The internal stores of the compound's components were able to be kept inert and non-reactive until they were loaded into the chem-furnace, and integration with a shorter, lower-velocity version of the HA Iskander's Assault Launcher allowed for precision deployment of payloads in specific directions. When running hot, the compound could also be used as a pseudo-steroid for its artificial musculature, and when exposed to external heat, could form a temporary insulating layer.</div><div>The finalized Bombardier proved to be so effective that it soon became standard-issue for all mining operations run by the Rubbleborn, and several have made their way into the hands of the Jovo Extraction Conglomerate as a gesture of goodwill.</div>",
    "mounts": [
      "Flex",
      "Main",
      "Heavy"
    ],
    "stats": {
      "size": 2,
      "structure": 4,
      "stress": 4,
      "armor": "1",
      "hp": "8",
      "evasion": 6,
      "edef": 6,
      "heatcap": "10",
      "repcap": "2",
      "sensor_range": "15",
      "tech_attack": "-2",
      "save": "10",
      "speed": "2",
      "sp": "5"
    },
    "traits": [
      {
        "name": "Munitions Launcher",
        "use": "",
        "description": "<div>When the Bombardier makes a Blast, Burst, Cone or Line attack with a ranged weapon, it can choose to use them through the munitions launcher, applying the following effects:</div><ul><li><div>The attack gains +3 Range (even if it does not have Range)</div></li><li><div>The weapon gains both the Arcing and Ordnance attack for the attack</div></li><li><div>Cone and Line attacks may be made in a different direction instead of straight from the Bombardier, as long as it falls within the Range of the Munitions Launcher.</div></li></ul>",
        "synergies": [
          {
            "locations": [
              "weapon"
            ],
            "detail": "<div>When the Bombardier makes a Blast, Burst, Cone or Line attack with a ranged weapon, it can choose to use them through the munitions launcher, applying the following effects:</div><ul><li><div>The attack gains +3 Range (even if it does not have Range)</div></li><li><div>The weapon gains both the Arcing and Ordnance attack for the attack</div></li><li><div>Cone and Line attacks may be made in a different direction instead of straight from the Bombardier, as long as it falls within the Range of the Munitions Launcher.</div></li></ul>",
            "weapon_types": [
              "Nexus",
              "CQB",
              "Launcher",
              "Rifle",
              "Cannon"
            ],
            "weapon_sizes": [],
            "system_types": []
          }
        ]
      },
      {
        "name": "Walk on Embers",
        "use": "",
        "description": "<div>While in the Danger Zone, the Bombardier’s base speed increases to 4, and it becomes immune to both difficult and dangerous terrain.</div>",
        "synergies": [
          {
            "locations": [
              "boost",
              "heat",
              "move"
            ],
            "detail": "<div>While in the Danger Zone, the Bombardier’s base speed increases to 4, and it becomes immune to both difficult and dangerous terrain.</div>",
            "weapon_types": [],
            "weapon_sizes": [],
            "system_types": []
          }
        ]
      }
    ],
    "core_system": {
      "name": "07/MCB Chemical Furnace",
      "active_name": "Master Terraformer",
      "active_effect": "<p>The Bombardier’s launcher systems are enhanced, and the safety limiters removed temporarily. For the rest of the scene:</p><ul><li><p>Acid zone placed by Corrosive Spray last until the end of the scene</p></li><li><p>Munition Launcher's base range is increased to 5.</p></li><li><p>Allied become immune to your Corrosive Spray</p></li></ul>",
      "activation": "Protocol",
      "description": "<p><em>\"Most volcanoes in Jovo are inactive. Don't mess with the Bombardiers if you want them to stay that way.\" -JXC Foreman Hudson, during a joint JXC/Rubblefolk mining operation.</em></p>",
      "deactivation": "",
      "use": "",
      "active_actions": [],
      "active_bonuses": [],
      "active_synergies": [],
      "passive_name": "Corrosive Spray",
      "passive_effect": "<p>1/round, when the Bombardier makes a blast, burst, cone or line attack, it can spray acid on a free space within the affected area, which becomes difficult and dangerous terrain, dealing 2 Burn to a character that starts their turn there or moves into the area for the first time in a round.</p><p>This spray lasts until the end of its next turn. For each critical hit it scores on such attacks, it can place an additional zone of acid.</p>",
      "passive_actions": [],
      "passive_bonuses": [],
      "passive_synergies": [
        {
          "locations": [
            "weapon"
          ],
          "detail": "<p>1/round, when the Bombardier makes a blast, burst, cone or line attack, it can spray acid on a free space within the affected area, which becomes difficult and dangerous terrain, dealing 2 Burn to a character that starts their turn there or moves into the area for the first time in a round.</p><p>This spray lasts until the end of its next turn. For each critical hit it scores on such attacks, it can place an additional zone of acid.</p>",
          "weapon_types": [
            "Rifle",
            "Cannon",
            "Launcher",
            "CQB",
            "Nexus"
          ],
          "weapon_sizes": [],
          "system_types": []
        }
      ],
      "deployables": [],
      "counters": [],
      "integrated": [],
      "special_equipment": [],
      "tags": []
    },
    "image_url": "https://cdn.discordapp.com/attachments/1045770818602422302/1058095506334691358/Bombardier_v2.png",
    "y_pos": "52"
  }
]